#Этот модуль нужен для записи названия(буквы) флешки и для проверки ключа на этой флешке


import os
import sys

def write():
    """
    эта функция нужна для записи названия(буквы) флешки и для записи на этой флешке .key с двоичным кодом
    """
    word_usb = input("Напишите букву флешки - ")
    if os.path.exists(word_usb):
        with open("C:/Windows/Word_usb.nls","w") as fp:
            fp.write(word_usb)

        with open(word_usb + "/.key",'w') as fp:
            fp.write("100010001011000100000010000110101100001111011000001000100001010000110101100001100011000011010110000010000110000100000100001111011000011010110000010000111111100001100001000100000010000111110100001110111000100110010000010110010000010000111111100001111101000100100010000110101100001110111000001000011110110000110000100010001011000100001110000111001100000100010000111000101000110000110001100001110001000100100110000110101")
        
    else:
        print("Флешка не обнаружена")
        input("\nДля продолжения нажмите Enter")
        sys.exit()

def check():
    """
    Эта функция нужна для проверки вставлена ли флешка и для проверки ключа на верность
    """
    with open("C:/Windows/Word_usb.nls","r") as file:
        word_usb = file.read()
    
    if os.path.exists(word_usb + "/.key"):
        with open(word_usb + "/.key","r") as file:
            key = file.read()
        
        if key == "100010001011000100000010000110101100001111011000001000100001010000110101100001100011000011010110000010000110000100000100001111011000011010110000010000111111100001100001000100000010000111110100001110111000100110010000010110010000010000111111100001111101000100100010000110101100001110111000001000011110110000110000100010001011000100001110000111001100000100010000111000101000110000110001100001110001000100100110000110101":
            print("Пароль верный")
        else:
            print("Неверный пароль")
    
    else:
        print("Флешка не обнаружена")
        input("\nДля продолжения нажмите Enter")
        sys.exit()
        